#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/example-org-9cf8e7/terraform-workshop/runs/run-rXY6ixoECk62JRou

Waiting for the plan to start...

Terraform v1.1.7
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.test_modules.aws_iam_user.lb: Refreshing state... [id=test-lb]
module.test_modules.aws_iam_policy.policy: Refreshing state... [id=arn:aws:iam::102451347770:policy/test_policy]
module.test_modules.aws_iam_user_policy.lb_ro: Refreshing state... [id=test-lb:test-policy]
module.test_modules.aws_iam_access_key.lb: Refreshing state... [id=AKIARPWUTQE5IVVQT45M]
module.lambda_function.local_file.archive_plan[0]: Refreshing state... [id=0e25d02a1ec922d534c552bb022451799112f6af]
module.lambda_function.null_resource.archive[0]: Refreshing state... [id=6689084223688945492]
aws_iam_user.lb: Refreshing state... [id=loadbalancer]
aws_iam_access_key.lb: Refreshing state... [id=AKIARPWUTQE5PMISXXH5]
aws_iam_user_policy.lb_ro: Refreshing state... [id=loadbalancer:dontettetetets]
aws_eks_cluster.sandbox: Refreshing state... [id=sandbox-eks-cluster]
module.lambda_function.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/my-lambda1]
module.lambda_function.aws_iam_role.lambda[0]: Refreshing state... [id=my-lambda1]
module.lambda_function.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::102451347770:policy/my-lambda1-logs]
module.lambda_function.aws_lambda_function.this[0]: Refreshing state... [id=my-lambda1]
module.lambda_function.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=my-lambda1-20220407100707815000000001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_eks_cluster.sandbox must be replaced
-/+ resource "aws_eks_cluster" "sandbox" {
      ~ arn                       = "arn:aws:eks:us-east-1:102451347770:cluster/sandbox-eks-cluster" -> (known after apply)
      ~ certificate_authority     = [
          - {
              - data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM1ekNDQWMrZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeU1EUXdPREEwTURJek1Gb1hEVE15TURRd05UQTBNREl6TUZvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTUhFCklDd0ZDTmRxdytsbkx3TTVYNHAwZTUrRXNERkIrbGRjNjZuWmpXRHlwUmo2aE4yT01OcnFwMlpJMWd0TFpINysKb1A4Q2loSVhqUUFYRGhwL3lwLzE4TTEwK3IweDhXQmtpVmMvZkRiNCtCNVZjb0lJa3U0QUhFcFQ4ZDVuU0RleQp6bTFlRVhMV242UU1SQmZkcGtGclJ0T1VJQ1BuV1ViZkZha0NuM1JwWEN0VUJPUWI4anhMT0o2M0wvREJZSk9TCnh5WXdTejNtOTc4Ylc4UFJTREpEam5nbURFa0lSZ250aUFSUXZ4cFhsSVdLdWpqZ0JsL0QyU2szK0RxNCtPQ0UKZWN1ZlRjQitxOXpjTFdQNjhrZTZrK3hqU3IvS09FWFZ1MHUxVmpHTmtOR2VaSDV3UHl0UmJJUUtrWURlSlhkZAoxWDBRNUlNdy9qbGpKTGE4WW04Q0F3RUFBYU5DTUVBd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZBaG5Hc3UxbmZjVGdZdXhEK1hqbnRheFpzb0tNQTBHQ1NxR1NJYjMKRFFFQkN3VUFBNElCQVFBOTVoL0srcnkrOURIQ2R4M0ZsQjQrR1cyTG1UZDByaXM1aHdHbHBUSGROTkRENGx3VwppV0orZnIxVFVhbmQwUkFDaURGWUNXUG96cHVBZDZpRGNYODBlaVh6UUk3bTQwVlJQeWJhSmFDUG03VTl5YnVmCkRXaXRmTVo2V0RwZlI3enFpT2VIQ2dzcy9uamJiR2xPbGJNL3NFRk9GRTMzQ3pvenJVaEhoQ2tlQ1hzUlBKeEgKY2hvMmQ2dXlYWHhlRDE2NjAzU3ZFM3R6b3R0ZW5PMUF6UW50anpvUlVYZE1OYUQ4ekErcGpFaTZHdFJ4N3JDeApIa0xlVjB1YkJDNDJqMWdDdWsvQldlQlpFVGhLZDd6VFhPWHdveCtSb0E5dm5kL3h2Yk1YKzBEa1pmTkhTbkt3Cnp0cWNWTGFpUzB1a2pheitrTjdyT0lpNzV5a3QreVd5QzZvWQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
            },
        ] -> (known after apply)
      ~ created_at                = "2022-04-08 03:55:58.464 +0000 UTC" -> (known after apply)
      - enabled_cluster_log_types = [] -> null
      ~ endpoint                  = "https://D2CCC04509A56E2C7AA6F3A3A0BBF142.gr7.us-east-1.eks.amazonaws.com" -> (known after apply)
      ~ id                        = "sandbox-eks-cluster" -> (known after apply)
      ~ identity                  = [
          - {
              - oidc = [
                  - {
                      - issuer = "https://oidc.eks.us-east-1.amazonaws.com/id/D2CCC04509A56E2C7AA6F3A3A0BBF142"
                    },
                ]
            },
        ] -> (known after apply)
        name                      = "sandbox-eks-cluster"
      ~ platform_version          = "eks.6" -> (known after apply)
      ~ status                    = "ACTIVE" -> (known after apply)
      - tags                      = {} -> null
      ~ tags_all                  = {} -> (known after apply)
      ~ version                   = "1.21" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ kubernetes_network_config {
          ~ ip_family         = "ipv4" -> (known after apply)
          ~ service_ipv4_cidr = "10.100.0.0/16" -> (known after apply)
        }

      - timeouts {}

      ~ vpc_config {
          ~ cluster_security_group_id = "sg-08dec384cf3b0f737" -> (known after apply)
          ~ public_access_cidrs       = [
              - "0.0.0.0/0",
            ] -> (known after apply)
          - security_group_ids        = [
              - "sg-165adf35",
            ] -> null # forces replacement
          ~ vpc_id                    = "vpc-0427347e" -> (known after apply)
            # (3 unchanged attributes hidden)
        }
    }

  # module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "6689084223688945492" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1649326916865540000" -> "1649756406313711800"
            # (1 unchanged element hidden)
        }
    }

Plan: 2 to add, 0 to change, 2 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "AWS_ACCESS_KEY_ID" but a
│ value was found in file "/terraform/terraform.tfvars". If you meant to use
│ this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "AWS_SECRET_ACCESS_KEY"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

```
</details>
*Pusher: @andylim0221, Action: `pull_request`*